cjacker/opensource-toolchain-8051/naken_asm-headers/n76e003.inc
P0 equ 0x80
SP equ 0x81
DPL equ 0x82
DPH equ 0x83
RWK equ 0x86
PCON equ 0x87
TCON equ 0x88
TMOD equ 0x89
TL0 equ 0x8A
TL1 equ 0x8B
TH0 equ 0x8C
TH1 equ 0x8D
CKCON equ 0x8E
WKCON equ 0x8F
P1 equ 0x90
SFRS equ 0x91
CAPCON0 equ 0x92
CAPCON1 equ 0x93
CAPCON2 equ 0x94
CKDIV equ 0x95
CKSWT equ 0x96
CKEN equ 0x97
SCON equ 0x98
SBUF equ 0x99
SBUF_1 equ 0x9A
EIE equ 0x9B
EIE1 equ 0x9C
CHPCON equ 0x9F
P2 equ 0xA0
AUXR1 equ 0xA2
BODCON0 equ 0xA3
IAPTRG equ 0xA4
IAPUEN equ 0xA5
IAPAL equ 0xA6
IAPAH equ 0xA7
IE equ 0xA8
SADDR equ 0xA9
WDCON equ 0xAA
BODCON1 equ 0xAB
P3M1 equ 0xAC
P3S equ 0xAC
P3M2 equ 0xAD
P3SR equ 0xAD
IAPFD equ 0xAE
IAPCN equ 0xAF
P3 equ 0xB0
P0M1 equ 0xB1
P0S equ 0xB1
P0M2 equ 0xB2
P0SR equ 0xB2
P1M1 equ 0xB3
P1S equ 0xB3
P1M2 equ 0xB4
P1SR equ 0xB4
P2S equ 0xB5
IPH equ 0xB7
PWMINTC equ 0xB7
IP equ 0xB8
SADEN equ 0xB9
SADEN_1 equ 0xBA
SADDR_1 equ 0xBB
I2DAT equ 0xBC
I2STAT equ 0xBD
I2CLK equ 0xBE
I2TOC equ 0xBF
I2CON equ 0xC0
I2ADDR equ 0xC1
ADCRL equ 0xC2
ADCRH equ 0xC3
T3CON equ 0xC4
PWM4H equ 0xC4
RL3 equ 0xC5
PWM5H equ 0xC5
RH3 equ 0xC6
PIOCON1 equ 0xC6
TA equ 0xC7
T2CON equ 0xC8
T2MOD equ 0xC9
RCMP2L equ 0xCA
RCMP2H equ 0xCB
TL2 equ 0xCC
PWM4L equ 0xCC
TH2 equ 0xCD
PWM5L equ 0xCD
ADCMPL equ 0xCE
ADCMPH equ 0xCF
PSW equ 0xD0
PWMPH equ 0xD1
PWM0H equ 0xD2
PWM1H equ 0xD3
PWM2H equ 0xD4
PWM3H equ 0xD5
PNP equ 0xD6
FBD equ 0xD7
PWMCON0 equ 0xD8
PWMPL equ 0xD9
PWM0L equ 0xDA
PWM1L equ 0xDB
PWM2L equ 0xDC
PWM3L equ 0xDD
PIOCON0 equ 0xDE
PWMCON1 equ 0xDF
ACC equ 0xE0
ADCCON1 equ 0xE1
ADCCON2 equ 0xE2
ADCDLY equ 0xE3
C0L equ 0xE4
C0H equ 0xE5
C1L equ 0xE6
C1H equ 0xE7
ADCCON0 equ 0xE8
PICON equ 0xE9
PINEN equ 0xEA
PIPEN equ 0xEB
PIF equ 0xEC
C2L equ 0xED
C2H equ 0xEE
EIP equ 0xEF
B equ 0xF0
CAPCON3 equ 0xF1
CAPCON4 equ 0xF2
SPCR equ 0xF3
SPCR2 equ 0xF3
SPSR equ 0xF4
SPDR equ 0xF5
AINDIDS equ 0xF6
EIPH equ 0xF7
SCON_1 equ 0xF8
PDTEN equ 0xF9
PDTCNT equ 0xFA
PMEN equ 0xFB
PMD equ 0xFC
EIP1 equ 0xFE
EIPH1 equ 0xFF

; bit aliases

TF1 equ 0x88+7
TR1 equ 0x88+6
TF0 equ 0x88+5
TR0 equ 0x88+4
IE1 equ 0x88+3
IT1 equ 0x88+2
IE0 equ 0x88+1
IT0 equ 0x88+0
SCL equ 0x90+3
SDA equ 0x90+4
SM0 equ 0x98+7
FE equ 0x98+7
SM1 equ 0x98+6
SM2 equ 0x98+5
REN equ 0x98+4
TB8 equ 0x98+3
RB8 equ 0x98+2
TI equ 0x98+1
RI equ 0x98+0
EA equ 0xA8+7
EADC equ 0xA8+6
EBOD equ 0xA8+5
ES equ 0xA8+4
ET1 equ 0xA8+3
EX1 equ 0xA8+2
ET0 equ 0xA8+1
EX0 equ 0xA8+0
INT0 equ 0xB0+0
PADC equ 0xB8+6
PBOD equ 0xB8+5
PS equ 0xB8+4
PT1 equ 0xB8+3
PX1 equ 0xB8+2
PT0 equ 0xB8+1
PX0 equ 0xB8+0
I2CEN equ 0xC0+6
STA equ 0xC0+5
STO equ 0xC0+4
SI equ 0xC0+3
AA equ 0xC0+2
I2CPX equ 0xC0+0
TF2 equ 0xC8+7
TR2 equ 0xC8+2
CM_RL2 equ 0xC8+0
CY equ 0xD0+7
AC equ 0xD0+6
F0 equ 0xD0+5
RS1 equ 0xD0+4
RS0 equ 0xD0+3
OV equ 0xD0+2
P equ 0xD0+0
PWMRUN equ 0xD8+7
LOAD equ 0xD8+6
PWMF equ 0xD8+5
CLRPWM equ 0xD8+4
ADCF equ 0xE8+7
ADCS equ 0xE8+6
ETGSEL1 equ 0xE8+5
ETGSEL0 equ 0xE8+4
ADCHS3 equ 0xE8+3
ADCHS2 equ 0xE8+2
ADCHS1 equ 0xE8+1
ADCHS0 equ 0xE8+0
SM0_1 equ 0xF8+7
FE_1 equ 0xF8+7
SM1_1 equ 0xF8+6
SM2_1 equ 0xF8+5
REN_1 equ 0xF8+4
TB8_1 equ 0xF8+3
RB8_1 equ 0xF8+2
TI_1 equ 0xF8+1
RI_1 equ 0xF8+0

; xdata

